In [1]:
import pandas as pd
import numpy as np

## Görev 1: Aşağıdaki Soruları Yanıtlayınız

### Soru 1: persona.csv dosyasını okutunuz ve veri seti ile ilgili genel bilgileri gösteriniz.

In [2]:
persona = pd.read_csv(r"C:\Users\myboz\OneDrive\Masaüstü\mybozkir\1. Projects\1. Miuul Data Analyst Path\4. Python\python_for_data_science\data_analysis_with_python\datasets\persona.csv")

In [3]:
persona.head()

   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17

In [4]:
persona.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB

In [5]:
persona.describe().T

        count     mean        std   min   25%   50%   75%   max
PRICE  5000.0  34.1320  12.464897   9.0  29.0  39.0  39.0  59.0
AGE    5000.0  23.5814   8.995908  15.0  17.0  21.0  27.0  66.0

In [6]:
persona.shape

(5000, 5)

### Soru 2: Kaç unique SOURCE vardır? Frekansları nelerdir?

In [7]:
persona.SOURCE.unique()

array(['android', 'ios'], dtype=object)

In [8]:
persona.SOURCE.value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

### Soru 3: Kaç unique PRICE vardır?

In [9]:
persona.PRICE.unique()

array([39, 49, 29, 19, 59,  9], dtype=int64)

In [10]:
persona.PRICE.nunique()

6

### Soru 4: Hangi PRICE'tan kaçar tane satış gerçekleşmiş?

In [11]:
persona[['PRICE']].value_counts()

PRICE
29       1305
39       1260
49       1031
19        992
59        212
9         200
dtype: int64

### Soru 5: Hangi ülkeden kaçar tane satış olmuş?

In [12]:
persona[['COUNTRY']].value_counts()

COUNTRY
usa        2065
bra        1496
deu         455
tur         451
fra         303
can         230
dtype: int64

### Soru 6: Ülkelere göre satışlardan toplam ne kadar kazanılmış?

In [13]:
persona.groupby('COUNTRY')[['PRICE']].sum()

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

### Soru 7: SOURCE türlerine göre satış sayıları nedir?

In [14]:
persona[['SOURCE']].value_counts()

SOURCE
android    2974
ios        2026
dtype: int64

### Soru 8: Ülkelere göre PRICE ortalamaları nelerdir?

In [15]:
persona.groupby(['COUNTRY'])[['PRICE']].mean()

             PRICE
COUNTRY
bra      34.327540
can      33.608696
deu      34.032967
fra      33.587459
tur      34.787140
usa      34.007264

### Soru 9: SOURCE'lara göre PRICE ortalamaları nedir?

In [16]:
persona.groupby('SOURCE')[['PRICE']].mean()

             PRICE
SOURCE
android  34.174849
ios      34.069102

### Soru 10: COUNTRY-SOURCE kırılımında PRICE ortalamaları nedir?

In [17]:
persona.groupby(['COUNTRY', 'SOURCE'])[['PRICE']].mean()

                     PRICE
COUNTRY SOURCE
bra     android  34.387029
        ios      34.222222
can     android  33.330709
        ios      33.951456
deu     android  33.869888
        ios      34.268817
fra     android  34.312500
        ios      32.776224
tur     android  36.229437
        ios      33.272727
usa     android  33.760357
        ios      34.371703

## Görev 2: COUNTRY-SOURCE-SEX-AGE kırılımında ortalama kazançlar nedir?

In [18]:
persona.groupby(['COUNTRY', 'SOURCE', 'SEX', 'AGE'])[['PRICE']].mean()

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897
...                               ...
usa     ios     male   42   30.250000
                       50   39.000000
                       53   34.000000
                       55   29.000000
                       59   46.500000

[348 rows x 1 columns]

## Görev 3: Çıktıyı PRICE'a göre sıralayınız.

#### Önceki sorudaki çıktıyı daha iyi görebilmek için sort_values metodunu azalan olacak şekilde PRICE'a göre uygulayınız.

#### Çıktıyı agg_df olarak kaydediniz.

In [19]:
persona.groupby(['COUNTRY', 'SOURCE', 'SEX', 'AGE'])[['PRICE']].mean().sort_values(by='PRICE', ascending=False)

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0
...                           ...
usa     ios     female 38    19.0
                       30    19.0
can     android female 27    19.0
fra     android male   18    19.0
deu     android male   26     9.0

[348 rows x 1 columns]

In [20]:
agg_df = persona.groupby(['COUNTRY', 'SOURCE', 'SEX', 'AGE'])[['PRICE']].mean().sort_values(by='PRICE', ascending=False)

## Görev 4: Indekste yer alan isimleri değişken ismine çeviriniz.

#### Üçüncü sorunun çıktısında yer alan PRICE dışındaki tüm değişkenler index isimleridir. Bu isimleri değişken isimlerine çeviriniz.

In [21]:
agg_df = agg_df.reset_index()

In [22]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE
0     bra  android    male   46   59.0
1     usa  android    male   36   59.0
2     fra  android  female   24   59.0
3     usa      ios    male   32   54.0
4     deu  android  female   36   49.0

## Görev 5: Age değişkenini kategorik değişkene çeviriniz ve agg_df'e ekleyiniz.

#### Age sayısal değişkenini kategorik değişkene çeviriniz.

#### Aralıkları ikna edici şekilde oluşturunuz.

#### Örneğin 0_18, 19_23, 24_30, 31_40, 41_70

In [23]:
rang = [0, 18, 23, 30, 40, agg_df['AGE'].max()]
names = ['0_18', '19_23', '24_30', '31_40', '41_' + str(agg_df['AGE'].max())]

agg_df['AGE_CAT'] = pd.cut(agg_df['AGE'], bins = rang, labels=names)

In [24]:
agg_df

    COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT
0       bra  android    male   46   59.0   41_66
1       usa  android    male   36   59.0   31_40
2       fra  android  female   24   59.0   24_30
3       usa      ios    male   32   54.0   31_40
4       deu  android  female   36   49.0   31_40
..      ...      ...     ...  ...    ...     ...
343     usa      ios  female   38   19.0   31_40
344     usa      ios  female   30   19.0   24_30
345     can  android  female   27   19.0   24_30
346     fra  android    male   18   19.0    0_18
347     deu  android    male   26    9.0   24_30

[348 rows x 6 columns]

## Görev 6: Yeni seviye tabanlı müşterileri (persona) tanımlayınız.

#### Yeni seviye tabanlı müşterileri (persona) tanımlayınız ve veri setine değişken olarak ekleyiniz.

#### Yeni eklenecek değişkenin adı: customer_level_based

#### Önceki soruda elde edeceğiniz çıktıdaki gözlemleri bir araya getirerek customer_level_based değişkenini oluşturmanız gerekmektedir.

In [30]:
agg_df['CUSTOMERS_LEVEL_BASED'] = agg_df['COUNTRY'].str.upper() + '_' + agg_df['SOURCE'].str.upper() + '_' + agg_df['SEX'].str.upper() + '_' + agg_df['AGE_CAT'].str.upper()

In [31]:
agg_df

    COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT     CUSTOMERS_LEVEL_BASED
0       bra  android    male   46   59.0   41_66    BRA_ANDROID_MALE_41_66
1       usa  android    male   36   59.0   31_40    USA_ANDROID_MALE_31_40
2       fra  android  female   24   59.0   24_30  FRA_ANDROID_FEMALE_24_30
3       usa      ios    male   32   54.0   31_40        USA_IOS_MALE_31_40
4       deu  android  female   36   49.0   31_40  DEU_ANDROID_FEMALE_31_40
..      ...      ...     ...  ...    ...     ...                       ...
343     usa      ios  female   38   19.0   31_40      USA_IOS_FEMALE_31_40
344     usa      ios  female   30   19.0   24_30      USA_IOS_FEMALE_24_30
345     can  android  female   27   19.0   24_30  CAN_ANDROID_FEMALE_24_30
346     fra  android    male   18   19.0    0_18     FRA_ANDROID_MALE_0_18
347     deu  android    male   26    9.0   24_30    DEU_ANDROID_MALE_24_30

[348 rows x 7 columns]

In [36]:
agg_df = agg_df.groupby('CUSTOMERS_LEVEL_BASED')[['PRICE']].mean().reset_index()

In [37]:
agg_df.head()

      CUSTOMERS_LEVEL_BASED      PRICE
0   BRA_ANDROID_FEMALE_0_18  35.645303
1  BRA_ANDROID_FEMALE_19_23  34.077340
2  BRA_ANDROID_FEMALE_24_30  33.863946
3  BRA_ANDROID_FEMALE_31_40  34.898326
4  BRA_ANDROID_FEMALE_41_66  36.737179

## Görev 7: Yeni müşterileri (personaları) segmentlere ayırınız.

#### Yeni müşterileri (Örnek: USA_ANDROID_MALE_0_18) PRICE'a göre 4 segmente ayırınız.

#### Segmentleri SEGMENT isimlendirmesi ile değişken olarak agg_df'e kaydediniz.

#### Segmentleri betimleyiniz (Segmentlere göre group by yapıp price mean, max, sum'larını alınız.)

In [40]:
agg_df['SEGMENT'] = pd.qcut(agg_df['PRICE'], 4, labels = ['D', 'C', 'B', 'A'])

In [41]:
agg_df

        CUSTOMERS_LEVEL_BASED      PRICE SEGMENT
0     BRA_ANDROID_FEMALE_0_18  35.645303       B
1    BRA_ANDROID_FEMALE_19_23  34.077340       C
2    BRA_ANDROID_FEMALE_24_30  33.863946       C
3    BRA_ANDROID_FEMALE_31_40  34.898326       B
4    BRA_ANDROID_FEMALE_41_66  36.737179       A
..                        ...        ...     ...
104         USA_IOS_MALE_0_18  33.983495       C
105        USA_IOS_MALE_19_23  34.901872       B
106        USA_IOS_MALE_24_30  34.838143       B
107        USA_IOS_MALE_31_40  36.206324       A
108        USA_IOS_MALE_41_66  35.750000       B

[109 rows x 3 columns]

In [44]:
agg_df.groupby('SEGMENT')[['PRICE']].agg({
    'PRICE': ['mean', 'max', 'sum']
})

             PRICE
              mean        max          sum
SEGMENT
D        29.206780  32.333333   817.789833
C        33.509674  34.077340   904.761209
B        34.999645  36.000000   944.990411
A        38.691234  45.428571  1044.663328

## Görev 8: Yeni gelen müşterileri sınıflandırıp, ne kadar gelir getirebileceklerini tahmin ediniz.

In [45]:
agg_df.head()

      CUSTOMERS_LEVEL_BASED      PRICE SEGMENT
0   BRA_ANDROID_FEMALE_0_18  35.645303       B
1  BRA_ANDROID_FEMALE_19_23  34.077340       C
2  BRA_ANDROID_FEMALE_24_30  33.863946       C
3  BRA_ANDROID_FEMALE_31_40  34.898326       B
4  BRA_ANDROID_FEMALE_41_66  36.737179       A

#### 33 Yaşında ANDROID kullanan bir Türk kadını hangi segmente aittir ve ortalama ne kadar gelir kazandırması beklenir?

In [50]:
agg_df[agg_df['CUSTOMERS_LEVEL_BASED'] == 'TUR_ANDROID_FEMALE_31_40']

       CUSTOMERS_LEVEL_BASED      PRICE SEGMENT
72  TUR_ANDROID_FEMALE_31_40  41.833333       A

#### 35 Yaşında IOS kullanan bir Fransız kadını hangi segmente aittir ve ortalama ne kadar gelir kazandırması beklenir?

In [51]:
agg_df[agg_df['CUSTOMERS_LEVEL_BASED'] == 'FRA_IOS_FEMALE_31_40']

   CUSTOMERS_LEVEL_BASED      PRICE SEGMENT
63  FRA_IOS_FEMALE_31_40  32.818182       C